/********************************************************************************
 json转换操作模块
 *******************************************************************************/

/********************************************************************************
 函数名：objToJson
 功能：对象转Json字符串
 输入参数: obj 对象
 返回值：转换后的Json字符串
 创建信息：谢建沅(2014-06-06)
 修改记录：无
 审 查 人：黎萍（2014-06-24） 
 *******************************************************************************/
exports.josnObj2JsonString = function(obj) {
    return JSON.stringify(obj);
}

/********************************************************************************
 函数名：jsonToObj
 功能：Json字符串转对象
 输入参数: str Json字符串
 返回值：转换后的对象
 创建信息：谢建沅(2014-06-06)
 修改记录：无
 审 查 人：黎萍（2014-06-24） 
 *******************************************************************************/
exports.jsonString2JsonObj = function(str) {
    return JSON.parse(str);
}
