/********************************************************************************
 日志模块（负责命令行输出和日志输出）
 *******************************************************************************/

/********************************************************************************
 函数名：assert
 功能：如果condition为false，则输出消息字符串并抛出AssertionError异常
 输入参数: condition 布尔值
 message 待输出的消息
 返回值：无
 创建信息：谢建沅(2014-06-06)
 修改记录：无
 审 查 人：黎萍（2014-06-24） 
 *******************************************************************************/
exports.assert = function(condition, msg) {
    console.assert(condition == true, msg);
}

/********************************************************************************
 函数名：log
 功能：输出到命令行
 输入参数: msg 输出字符
 返回值：无
 创建信息：谢建沅(2014-06-06)
 修改记录：无
 审 查 人：黎萍（2014-06-24） 
 *******************************************************************************/
exports.log = function(msg) {
    console.log(msg);
}
/********************************************************************************
 函数名：error
 功能：报错到命令行
 输入参数: msg 输出字符
 err 错误对象
 返回值：无
 创建信息：谢建沅(2014-06-06)
 修改记录：无
 审 查 人：黎萍（2014-06-24） 
 *******************************************************************************/
exports.error = function(msg,err) {
    //如果只传入一个参数
    if(err === undefined)
    {
        console.error(msg);
    } else{
        console.error(msg + ' --> ' + err);
    }
}
